hw3/rottenpotatoes/app/controllers/movies_controller.rb

  def index
    #@movies = Movie.all

    #@all_ratings = Movie.get_all_ratings

    sort = params[:sort] || session[:sort]

    case sort
      when 'title'
        ordering,@title_header = {:order => :title}, 'hilite'

      when 'release_date'
        ordering,@date_header = {:order => :release_date}, 'hilite'

      end

    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}


    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN (NULL) ORDER BY release_date